
# reading input verilog File
read_verilog test_code.v

# Converting proc to logic elements
proc;
# Optimizations
setattr -set fsm_encoding "none" test_code.current_state
opt -nosdff -nodffe

fsm_detect -ignore-self-reset

fsm_extract

opt_clean

fsm_opt

fsm_info 
fsm_export -o test_code_1.kiss2
